	Feature: Търсене на кинопрожекция от приложението MyMovie

  Scenario: Използване на инструмента търсачка за откриване на дадена прожекция в различни киносалони
    Given Клиентът стартира бутона за търсене.
    When Въвежда името на филма, който иска да намери в полето за търсене "Harry Potter"
    And Натиска лупичката на бутона за търсене с въведената информация.
    Then Вижда съобщение "MovieResultsAreFine".
    
  
  

  Scenario: Търсене на филм с неналични прожекции
    Given Клиентът стартира бутона за търсене.
    When Въвежда името на филма, който иска да намери в полето за търсене "Star Wars"
    And Натиска лупичката на бутона за търсене с въведената информация.
    Then Вижда съобщение "Неналични прожекции".
    
    Scenario: Търсене на филм с липса на въведени данни
    Given Клиентът стартира бутона за търсене.
    And Натиска лупичката на бутона за търсене без въведената информация.
    Then Вижда съобщение "Въведете името на филма".
    
    